GopalSaraf/Practicals/PSDL/include/proc/pic16lf1614.inc
// Register: PID1Z2U
#define PID1Z2U PID1Z2U
PID1Z2U                                  equ 060Eh
// bitfield definitions
PID1Z2U_PID1Z216_POSN                    equ 0000h
PID1Z2U_PID1Z216_POSITION                equ 0000h
PID1Z2U_PID1Z216_SIZE                    equ 0001h
PID1Z2U_PID1Z216_LENGTH                  equ 0001h
PID1Z2U_PID1Z216_MASK                    equ 0001h
PID1Z2U_Z216_POSN                        equ 0000h
PID1Z2U_Z216_POSITION                    equ 0000h
PID1Z2U_Z216_SIZE                        equ 0001h
PID1Z2U_Z216_LENGTH                      equ 0001h
PID1Z2U_Z216_MASK                        equ 0001h

// Register: PID1ACCLL
#define PID1ACCLL PID1ACCLL
PID1ACCLL                                equ 060Fh
// bitfield definitions
PID1ACCLL_PID1ACC0_POSN                  equ 0000h
PID1ACCLL_PID1ACC0_POSITION              equ 0000h
PID1ACCLL_PID1ACC0_SIZE                  equ 0001h
PID1ACCLL_PID1ACC0_LENGTH                equ 0001h
PID1ACCLL_PID1ACC0_MASK                  equ 0001h
PID1ACCLL_PID1ACC1_POSN                  equ 0001h
PID1ACCLL_PID1ACC1_POSITION              equ 0001h
PID1ACCLL_PID1ACC1_SIZE                  equ 0001h
PID1ACCLL_PID1ACC1_LENGTH                equ 0001h
PID1ACCLL_PID1ACC1_MASK                  equ 0002h
PID1ACCLL_PID1ACC2_POSN                  equ 0002h
PID1ACCLL_PID1ACC2_POSITION              equ 0002h
PID1ACCLL_PID1ACC2_SIZE                  equ 0001h
PID1ACCLL_PID1ACC2_LENGTH                equ 0001h
PID1ACCLL_PID1ACC2_MASK                  equ 0004h
PID1ACCLL_PID1ACC3_POSN                  equ 0003h
PID1ACCLL_PID1ACC3_POSITION              equ 0003h
PID1ACCLL_PID1ACC3_SIZE                  equ 0001h
PID1ACCLL_PID1ACC3_LENGTH                equ 0001h
PID1ACCLL_PID1ACC3_MASK                  equ 0008h
PID1ACCLL_PID1ACC4_POSN                  equ 0004h
PID1ACCLL_PID1ACC4_POSITION              equ 0004h
PID1ACCLL_PID1ACC4_SIZE                  equ 0001h
PID1ACCLL_PID1ACC4_LENGTH                equ 0001h
PID1ACCLL_PID1ACC4_MASK                  equ 0010h
PID1ACCLL_PID1ACC5_POSN                  equ 0005h
PID1ACCLL_PID1ACC5_POSITION              equ 0005h
PID1ACCLL_PID1ACC5_SIZE                  equ 0001h
PID1ACCLL_PID1ACC5_LENGTH                equ 0001h
PID1ACCLL_PID1ACC5_MASK                  equ 0020h
PID1ACCLL_PID1ACC6_POSN                  equ 0006h
PID1ACCLL_PID1ACC6_POSITION              equ 0006h
PID1ACCLL_PID1ACC6_SIZE                  equ 0001h
PID1ACCLL_PID1ACC6_LENGTH                equ 0001h
PID1ACCLL_PID1ACC6_MASK                  equ 0040h
PID1ACCLL_PID1ACC7_POSN                  equ 0007h
PID1ACCLL_PID1ACC7_POSITION              equ 0007h
PID1ACCLL_PID1ACC7_SIZE                  equ 0001h
PID1ACCLL_PID1ACC7_LENGTH                equ 0001h
PID1ACCLL_PID1ACC7_MASK                  equ 0080h
PID1ACCLL_ACC0_POSN                      equ 0000h
PID1ACCLL_ACC0_POSITION                  equ 0000h
PID1ACCLL_ACC0_SIZE                      equ 0001h
PID1ACCLL_ACC0_LENGTH                    equ 0001h
PID1ACCLL_ACC0_MASK                      equ 0001h
PID1ACCLL_ACC1_POSN                      equ 0001h
PID1ACCLL_ACC1_POSITION                  equ 0001h
PID1ACCLL_ACC1_SIZE                      equ 0001h
PID1ACCLL_ACC1_LENGTH                    equ 0001h
PID1ACCLL_ACC1_MASK                      equ 0002h
PID1ACCLL_ACC2_POSN                      equ 0002h
PID1ACCLL_ACC2_POSITION                  equ 0002h
PID1ACCLL_ACC2_SIZE                      equ 0001h
PID1ACCLL_ACC2_LENGTH                    equ 0001h
PID1ACCLL_ACC2_MASK                      equ 0004h
PID1ACCLL_ACC3_POSN                      equ 0003h
PID1ACCLL_ACC3_POSITION                  equ 0003h
PID1ACCLL_ACC3_SIZE                      equ 0001h
PID1ACCLL_ACC3_LENGTH                    equ 0001h
PID1ACCLL_ACC3_MASK                      equ 0008h
PID1ACCLL_ACC4_POSN                      equ 0004h
PID1ACCLL_ACC4_POSITION                  equ 0004h
PID1ACCLL_ACC4_SIZE                      equ 0001h
PID1ACCLL_ACC4_LENGTH                    equ 0001h
PID1ACCLL_ACC4_MASK                      equ 0010h
PID1ACCLL_ACC5_POSN                      equ 0005h
PID1ACCLL_ACC5_POSITION                  equ 0005h
PID1ACCLL_ACC5_SIZE                      equ 0001h
PID1ACCLL_ACC5_LENGTH                    equ 0001h
PID1ACCLL_ACC5_MASK                      equ 0020h
PID1ACCLL_ACC6_POSN                      equ 0006h
PID1ACCLL_ACC6_POSITION                  equ 0006h
PID1ACCLL_ACC6_SIZE                      equ 0001h
PID1ACCLL_ACC6_LENGTH                    equ 0001h
PID1ACCLL_ACC6_MASK                      equ 0040h
PID1ACCLL_ACC7_POSN                      equ 0007h
PID1ACCLL_ACC7_POSITION                  equ 0007h
PID1ACCLL_ACC7_SIZE                      equ 0001h
PID1ACCLL_ACC7_LENGTH                    equ 0001h
PID1ACCLL_ACC7_MASK                      equ 0080h

// Register: PID1ACCLH
#define PID1ACCLH PID1ACCLH
PID1ACCLH                                equ 0610h
// bitfield definitions
PID1ACCLH_PID1ACC8_POSN                  equ 0000h
PID1ACCLH_PID1ACC8_POSITION              equ 0000h
PID1ACCLH_PID1ACC8_SIZE                  equ 0001h
PID1ACCLH_PID1ACC8_LENGTH                equ 0001h
PID1ACCLH_PID1ACC8_MASK                  equ 0001h
PID1ACCLH_PID1ACC9_POSN                  equ 0001h
PID1ACCLH_PID1ACC9_POSITION              equ 0001h
PID1ACCLH_PID1ACC9_SIZE                  equ 0001h
PID1ACCLH_PID1ACC9_LENGTH                equ 0001h
PID1ACCLH_PID1ACC9_MASK                  equ 0002h
PID1ACCLH_PID1ACC10_POSN                 equ 0002h
PID1ACCLH_PID1ACC10_POSITION             equ 0002h
PID1ACCLH_PID1ACC10_SIZE                 equ 0001h
PID1ACCLH_PID1ACC10_LENGTH               equ 0001h
PID1ACCLH_PID1ACC10_MASK                 equ 0004h
PID1ACCLH_PID1ACC11_POSN                 equ 0003h
PID1ACCLH_PID1ACC11_POSITION             equ 0003h
PID1ACCLH_PID1ACC11_SIZE                 equ 0001h
PID1ACCLH_PID1ACC11_LENGTH               equ 0001h
PID1ACCLH_PID1ACC11_MASK                 equ 0008h
PID1ACCLH_PID1ACC12_POSN                 equ 0004h
PID1ACCLH_PID1ACC12_POSITION             equ 0004h
PID1ACCLH_PID1ACC12_SIZE                 equ 0001h
PID1ACCLH_PID1ACC12_LENGTH               equ 0001h
PID1ACCLH_PID1ACC12_MASK                 equ 0010h
PID1ACCLH_PID1ACC13_POSN                 equ 0005h
PID1ACCLH_PID1ACC13_POSITION             equ 0005h
PID1ACCLH_PID1ACC13_SIZE                 equ 0001h
PID1ACCLH_PID1ACC13_LENGTH               equ 0001h
PID1ACCLH_PID1ACC13_MASK                 equ 0020h
PID1ACCLH_PID1ACC14_POSN                 equ 0006h
PID1ACCLH_PID1ACC14_POSITION             equ 0006h
PID1ACCLH_PID1ACC14_SIZE                 equ 0001h
PID1ACCLH_PID1ACC14_LENGTH               equ 0001h
PID1ACCLH_PID1ACC14_MASK                 equ 0040h
PID1ACCLH_PID1ACC15_POSN                 equ 0007h
PID1ACCLH_PID1ACC15_POSITION             equ 0007h
PID1ACCLH_PID1ACC15_SIZE                 equ 0001h
PID1ACCLH_PID1ACC15_LENGTH               equ 0001h
PID1ACCLH_PID1ACC15_MASK                 equ 0080h
PID1ACCLH_ACC8_POSN                      equ 0000h
PID1ACCLH_ACC8_POSITION                  equ 0000h
PID1ACCLH_ACC8_SIZE                      equ 0001h
PID1ACCLH_ACC8_LENGTH                    equ 0001h
PID1ACCLH_ACC8_MASK                      equ 0001h
PID1ACCLH_ACC9_POSN                      equ 0001h
PID1ACCLH_ACC9_POSITION                  equ 0001h
PID1ACCLH_ACC9_SIZE                      equ 0001h
PID1ACCLH_ACC9_LENGTH                    equ 0001h
PID1ACCLH_ACC9_MASK                      equ 0002h
PID1ACCLH_ACC10_POSN                     equ 0002h
PID1ACCLH_ACC10_POSITION                 equ 0002h
PID1ACCLH_ACC10_SIZE                     equ 0001h
PID1ACCLH_ACC10_LENGTH                   equ 0001h
PID1ACCLH_ACC10_MASK                     equ 0004h
PID1ACCLH_ACC11_POSN                     equ 0003h
PID1ACCLH_ACC11_POSITION                 equ 0003h
PID1ACCLH_ACC11_SIZE                     equ 0001h
PID1ACCLH_ACC11_LENGTH                   equ 0001h
PID1ACCLH_ACC11_MASK                     equ 0008h
PID1ACCLH_ACC12_POSN                     equ 0004h
PID1ACCLH_ACC12_POSITION                 equ 0004h
PID1ACCLH_ACC12_SIZE                     equ 0001h
PID1ACCLH_ACC12_LENGTH                   equ 0001h
PID1ACCLH_ACC12_MASK                     equ 0010h
PID1ACCLH_ACC13_POSN                     equ 0005h
PID1ACCLH_ACC13_POSITION                 equ 0005h
PID1ACCLH_ACC13_SIZE                     equ 0001h
PID1ACCLH_ACC13_LENGTH                   equ 0001h
PID1ACCLH_ACC13_MASK                     equ 0020h
PID1ACCLH_ACC14_POSN                     equ 0006h
PID1ACCLH_ACC14_POSITION                 equ 0006h
PID1ACCLH_ACC14_SIZE                     equ 0001h
PID1ACCLH_ACC14_LENGTH                   equ 0001h
PID1ACCLH_ACC14_MASK                     equ 0040h
PID1ACCLH_ACC15_POSN                     equ 0007h
PID1ACCLH_ACC15_POSITION                 equ 0007h
PID1ACCLH_ACC15_SIZE                     equ 0001h
PID1ACCLH_ACC15_LENGTH                   equ 0001h
PID1ACCLH_ACC15_MASK                     equ 0080h

