GopalSaraf/Practicals/PSDL/include/proc/pic16lf1614.inc
// Register: ATINPPS
#define ATINPPS ATINPPS
ATINPPS                                  equ 0E16h
// bitfield definitions
ATINPPS_ATINPPS0_POSN                    equ 0000h
ATINPPS_ATINPPS0_POSITION                equ 0000h
ATINPPS_ATINPPS0_SIZE                    equ 0001h
ATINPPS_ATINPPS0_LENGTH                  equ 0001h
ATINPPS_ATINPPS0_MASK                    equ 0001h
ATINPPS_ATINPPS1_POSN                    equ 0001h
ATINPPS_ATINPPS1_POSITION                equ 0001h
ATINPPS_ATINPPS1_SIZE                    equ 0001h
ATINPPS_ATINPPS1_LENGTH                  equ 0001h
ATINPPS_ATINPPS1_MASK                    equ 0002h
ATINPPS_ATINPPS2_POSN                    equ 0002h
ATINPPS_ATINPPS2_POSITION                equ 0002h
ATINPPS_ATINPPS2_SIZE                    equ 0001h
ATINPPS_ATINPPS2_LENGTH                  equ 0001h
ATINPPS_ATINPPS2_MASK                    equ 0004h
ATINPPS_ATINPPS3_POSN                    equ 0003h
ATINPPS_ATINPPS3_POSITION                equ 0003h
ATINPPS_ATINPPS3_SIZE                    equ 0001h
ATINPPS_ATINPPS3_LENGTH                  equ 0001h
ATINPPS_ATINPPS3_MASK                    equ 0008h
ATINPPS_ATINPPS4_POSN                    equ 0004h
ATINPPS_ATINPPS4_POSITION                equ 0004h
ATINPPS_ATINPPS4_SIZE                    equ 0001h
ATINPPS_ATINPPS4_LENGTH                  equ 0001h
ATINPPS_ATINPPS4_MASK                    equ 0010h

// Register: CWGINPPS
#define CWGINPPS CWGINPPS
CWGINPPS                                 equ 0E17h
// bitfield definitions
CWGINPPS_CWGINPPS0_POSN                  equ 0000h
CWGINPPS_CWGINPPS0_POSITION              equ 0000h
CWGINPPS_CWGINPPS0_SIZE                  equ 0001h
CWGINPPS_CWGINPPS0_LENGTH                equ 0001h
CWGINPPS_CWGINPPS0_MASK                  equ 0001h
CWGINPPS_CWGINPPS1_POSN                  equ 0001h
CWGINPPS_CWGINPPS1_POSITION              equ 0001h
CWGINPPS_CWGINPPS1_SIZE                  equ 0001h
CWGINPPS_CWGINPPS1_LENGTH                equ 0001h
CWGINPPS_CWGINPPS1_MASK                  equ 0002h
CWGINPPS_CWGINPPS2_POSN                  equ 0002h
CWGINPPS_CWGINPPS2_POSITION              equ 0002h
CWGINPPS_CWGINPPS2_SIZE                  equ 0001h
CWGINPPS_CWGINPPS2_LENGTH                equ 0001h
CWGINPPS_CWGINPPS2_MASK                  equ 0004h
CWGINPPS_CWGINPPS3_POSN                  equ 0003h
CWGINPPS_CWGINPPS3_POSITION              equ 0003h
CWGINPPS_CWGINPPS3_SIZE                  equ 0001h
CWGINPPS_CWGINPPS3_LENGTH                equ 0001h
CWGINPPS_CWGINPPS3_MASK                  equ 0008h
CWGINPPS_CWGINPPS4_POSN                  equ 0004h
CWGINPPS_CWGINPPS4_POSITION              equ 0004h
CWGINPPS_CWGINPPS4_SIZE                  equ 0001h
CWGINPPS_CWGINPPS4_LENGTH                equ 0001h
CWGINPPS_CWGINPPS4_MASK                  equ 0010h

// Register: T2PPS
#define T2PPS T2PPS
T2PPS                                    equ 0E18h
// bitfield definitions
T2PPS_T2PPS0_POSN                        equ 0000h
T2PPS_T2PPS0_POSITION                    equ 0000h
T2PPS_T2PPS0_SIZE                        equ 0001h
T2PPS_T2PPS0_LENGTH                      equ 0001h
T2PPS_T2PPS0_MASK                        equ 0001h
T2PPS_T2PPS1_POSN                        equ 0001h
T2PPS_T2PPS1_POSITION                    equ 0001h
T2PPS_T2PPS1_SIZE                        equ 0001h
T2PPS_T2PPS1_LENGTH                      equ 0001h
T2PPS_T2PPS1_MASK                        equ 0002h
T2PPS_T2PPS2_POSN                        equ 0002h
T2PPS_T2PPS2_POSITION                    equ 0002h
T2PPS_T2PPS2_SIZE                        equ 0001h
T2PPS_T2PPS2_LENGTH                      equ 0001h
T2PPS_T2PPS2_MASK                        equ 0004h
T2PPS_T2PPS3_POSN                        equ 0003h
T2PPS_T2PPS3_POSITION                    equ 0003h
T2PPS_T2PPS3_SIZE                        equ 0001h
T2PPS_T2PPS3_LENGTH                      equ 0001h
T2PPS_T2PPS3_MASK                        equ 0008h
T2PPS_T2PPS4_POSN                        equ 0004h
T2PPS_T2PPS4_POSITION                    equ 0004h
T2PPS_T2PPS4_SIZE                        equ 0001h
T2PPS_T2PPS4_LENGTH                      equ 0001h
T2PPS_T2PPS4_MASK                        equ 0010h

// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
T3CKIPPS                                 equ 0E19h
// bitfield definitions
T3CKIPPS_T3CKIPPS0_POSN                  equ 0000h
T3CKIPPS_T3CKIPPS0_POSITION              equ 0000h
T3CKIPPS_T3CKIPPS0_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS0_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS0_MASK                  equ 0001h
T3CKIPPS_T3CKIPPS1_POSN                  equ 0001h
T3CKIPPS_T3CKIPPS1_POSITION              equ 0001h
T3CKIPPS_T3CKIPPS1_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS1_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS1_MASK                  equ 0002h
T3CKIPPS_T3CKIPPS2_POSN                  equ 0002h
T3CKIPPS_T3CKIPPS2_POSITION              equ 0002h
T3CKIPPS_T3CKIPPS2_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS2_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS2_MASK                  equ 0004h
T3CKIPPS_T3CKIPPS3_POSN                  equ 0003h
T3CKIPPS_T3CKIPPS3_POSITION              equ 0003h
T3CKIPPS_T3CKIPPS3_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS3_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS3_MASK                  equ 0008h
T3CKIPPS_T3CKIPPS4_POSN                  equ 0004h
T3CKIPPS_T3CKIPPS4_POSITION              equ 0004h
T3CKIPPS_T3CKIPPS4_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS4_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS4_MASK                  equ 0010h

// Register: T3GPPS
#define T3GPPS T3GPPS
T3GPPS                                   equ 0E1Ah
// bitfield definitions
T3GPPS_T3GPPS0_POSN                      equ 0000h
T3GPPS_T3GPPS0_POSITION                  equ 0000h
T3GPPS_T3GPPS0_SIZE                      equ 0001h
T3GPPS_T3GPPS0_LENGTH                    equ 0001h
T3GPPS_T3GPPS0_MASK                      equ 0001h
T3GPPS_T3GPPS1_POSN                      equ 0001h
T3GPPS_T3GPPS1_POSITION                  equ 0001h
T3GPPS_T3GPPS1_SIZE                      equ 0001h
T3GPPS_T3GPPS1_LENGTH                    equ 0001h
T3GPPS_T3GPPS1_MASK                      equ 0002h
T3GPPS_T3GPPS2_POSN                      equ 0002h
T3GPPS_T3GPPS2_POSITION                  equ 0002h
T3GPPS_T3GPPS2_SIZE                      equ 0001h
T3GPPS_T3GPPS2_LENGTH                    equ 0001h
T3GPPS_T3GPPS2_MASK                      equ 0004h
T3GPPS_T3GPPS3_POSN                      equ 0003h
T3GPPS_T3GPPS3_POSITION                  equ 0003h
T3GPPS_T3GPPS3_SIZE                      equ 0001h
T3GPPS_T3GPPS3_LENGTH                    equ 0001h
T3GPPS_T3GPPS3_MASK                      equ 0008h
T3GPPS_T3GPPS4_POSN                      equ 0004h
T3GPPS_T3GPPS4_POSITION                  equ 0004h
T3GPPS_T3GPPS4_SIZE                      equ 0001h
T3GPPS_T3GPPS4_LENGTH                    equ 0001h
T3GPPS_T3GPPS4_MASK                      equ 0010h

