GopalSaraf/Practicals/PSDL/include/proc/pic16lf1614.inc
// Register: ATCC2PPS
#define ATCC2PPS ATCC2PPS
ATCC2PPS                                 equ 0E23h
// bitfield definitions
ATCC2PPS_ATCC2PPS0_POSN                  equ 0000h
ATCC2PPS_ATCC2PPS0_POSITION              equ 0000h
ATCC2PPS_ATCC2PPS0_SIZE                  equ 0001h
ATCC2PPS_ATCC2PPS0_LENGTH                equ 0001h
ATCC2PPS_ATCC2PPS0_MASK                  equ 0001h
ATCC2PPS_ATCC2PPS1_POSN                  equ 0001h
ATCC2PPS_ATCC2PPS1_POSITION              equ 0001h
ATCC2PPS_ATCC2PPS1_SIZE                  equ 0001h
ATCC2PPS_ATCC2PPS1_LENGTH                equ 0001h
ATCC2PPS_ATCC2PPS1_MASK                  equ 0002h
ATCC2PPS_ATCC2PPS2_POSN                  equ 0002h
ATCC2PPS_ATCC2PPS2_POSITION              equ 0002h
ATCC2PPS_ATCC2PPS2_SIZE                  equ 0001h
ATCC2PPS_ATCC2PPS2_LENGTH                equ 0001h
ATCC2PPS_ATCC2PPS2_MASK                  equ 0004h
ATCC2PPS_ATCC2PPS3_POSN                  equ 0003h
ATCC2PPS_ATCC2PPS3_POSITION              equ 0003h
ATCC2PPS_ATCC2PPS3_SIZE                  equ 0001h
ATCC2PPS_ATCC2PPS3_LENGTH                equ 0001h
ATCC2PPS_ATCC2PPS3_MASK                  equ 0008h
ATCC2PPS_ATCC2PPS4_POSN                  equ 0004h
ATCC2PPS_ATCC2PPS4_POSITION              equ 0004h
ATCC2PPS_ATCC2PPS4_SIZE                  equ 0001h
ATCC2PPS_ATCC2PPS4_LENGTH                equ 0001h
ATCC2PPS_ATCC2PPS4_MASK                  equ 0010h

// Register: RXPPS
#define RXPPS RXPPS
RXPPS                                    equ 0E24h
// bitfield definitions
RXPPS_RXPPS0_POSN                        equ 0000h
RXPPS_RXPPS0_POSITION                    equ 0000h
RXPPS_RXPPS0_SIZE                        equ 0001h
RXPPS_RXPPS0_LENGTH                      equ 0001h
RXPPS_RXPPS0_MASK                        equ 0001h
RXPPS_RXPPS1_POSN                        equ 0001h
RXPPS_RXPPS1_POSITION                    equ 0001h
RXPPS_RXPPS1_SIZE                        equ 0001h
RXPPS_RXPPS1_LENGTH                      equ 0001h
RXPPS_RXPPS1_MASK                        equ 0002h
RXPPS_RXPPS2_POSN                        equ 0002h
RXPPS_RXPPS2_POSITION                    equ 0002h
RXPPS_RXPPS2_SIZE                        equ 0001h
RXPPS_RXPPS2_LENGTH                      equ 0001h
RXPPS_RXPPS2_MASK                        equ 0004h
RXPPS_RXPPS3_POSN                        equ 0003h
RXPPS_RXPPS3_POSITION                    equ 0003h
RXPPS_RXPPS3_SIZE                        equ 0001h
RXPPS_RXPPS3_LENGTH                      equ 0001h
RXPPS_RXPPS3_MASK                        equ 0008h
RXPPS_RXPPS4_POSN                        equ 0004h
RXPPS_RXPPS4_POSITION                    equ 0004h
RXPPS_RXPPS4_SIZE                        equ 0001h
RXPPS_RXPPS4_LENGTH                      equ 0001h
RXPPS_RXPPS4_MASK                        equ 0010h

// Register: CKPPS
#define CKPPS CKPPS
CKPPS                                    equ 0E25h
// bitfield definitions
CKPPS_CKPPS0_POSN                        equ 0000h
CKPPS_CKPPS0_POSITION                    equ 0000h
CKPPS_CKPPS0_SIZE                        equ 0001h
CKPPS_CKPPS0_LENGTH                      equ 0001h
CKPPS_CKPPS0_MASK                        equ 0001h
CKPPS_CKPPS1_POSN                        equ 0001h
CKPPS_CKPPS1_POSITION                    equ 0001h
CKPPS_CKPPS1_SIZE                        equ 0001h
CKPPS_CKPPS1_LENGTH                      equ 0001h
CKPPS_CKPPS1_MASK                        equ 0002h
CKPPS_CKPPS2_POSN                        equ 0002h
CKPPS_CKPPS2_POSITION                    equ 0002h
CKPPS_CKPPS2_SIZE                        equ 0001h
CKPPS_CKPPS2_LENGTH                      equ 0001h
CKPPS_CKPPS2_MASK                        equ 0004h
CKPPS_CKPPS3_POSN                        equ 0003h
CKPPS_CKPPS3_POSITION                    equ 0003h
CKPPS_CKPPS3_SIZE                        equ 0001h
CKPPS_CKPPS3_LENGTH                      equ 0001h
CKPPS_CKPPS3_MASK                        equ 0008h
CKPPS_CKPPS4_POSN                        equ 0004h
CKPPS_CKPPS4_POSITION                    equ 0004h
CKPPS_CKPPS4_SIZE                        equ 0001h
CKPPS_CKPPS4_LENGTH                      equ 0001h
CKPPS_CKPPS4_MASK                        equ 0010h

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
SMT1SIGPPS                               equ 0E26h
// bitfield definitions
SMT1SIGPPS_SMT1SIGPPS0_POSN              equ 0000h
SMT1SIGPPS_SMT1SIGPPS0_POSITION          equ 0000h
SMT1SIGPPS_SMT1SIGPPS0_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS0_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS0_MASK              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_POSN              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_POSITION          equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_MASK              equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_POSN              equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_POSITION          equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS2_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS2_MASK              equ 0004h
SMT1SIGPPS_SMT1SIGPPS3_POSN              equ 0003h
SMT1SIGPPS_SMT1SIGPPS3_POSITION          equ 0003h
SMT1SIGPPS_SMT1SIGPPS3_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS3_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS3_MASK              equ 0008h
SMT1SIGPPS_SMT1SIGPPS4_POSN              equ 0004h
SMT1SIGPPS_SMT1SIGPPS4_POSITION          equ 0004h
SMT1SIGPPS_SMT1SIGPPS4_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS4_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS4_MASK              equ 0010h

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
SMT1WINPPS                               equ 0E27h
// bitfield definitions
SMT1WINPPS_SMTWINPPS0_POSN               equ 0000h
SMT1WINPPS_SMTWINPPS0_POSITION           equ 0000h
SMT1WINPPS_SMTWINPPS0_SIZE               equ 0001h
SMT1WINPPS_SMTWINPPS0_LENGTH             equ 0001h
SMT1WINPPS_SMTWINPPS0_MASK               equ 0001h
SMT1WINPPS_SMTWINPPS1_POSN               equ 0001h
SMT1WINPPS_SMTWINPPS1_POSITION           equ 0001h
SMT1WINPPS_SMTWINPPS1_SIZE               equ 0001h
SMT1WINPPS_SMTWINPPS1_LENGTH             equ 0001h
SMT1WINPPS_SMTWINPPS1_MASK               equ 0002h
SMT1WINPPS_SMTWINPPS2_POSN               equ 0002h
SMT1WINPPS_SMTWINPPS2_POSITION           equ 0002h
SMT1WINPPS_SMTWINPPS2_SIZE               equ 0001h
SMT1WINPPS_SMTWINPPS2_LENGTH             equ 0001h
SMT1WINPPS_SMTWINPPS2_MASK               equ 0004h
SMT1WINPPS_SMTWINPPS3_POSN               equ 0003h
SMT1WINPPS_SMTWINPPS3_POSITION           equ 0003h
SMT1WINPPS_SMTWINPPS3_SIZE               equ 0001h
SMT1WINPPS_SMTWINPPS3_LENGTH             equ 0001h
SMT1WINPPS_SMTWINPPS3_MASK               equ 0008h
SMT1WINPPS_SMTWINPPS4_POSN               equ 0004h
SMT1WINPPS_SMTWINPPS4_POSITION           equ 0004h
SMT1WINPPS_SMTWINPPS4_SIZE               equ 0001h
SMT1WINPPS_SMTWINPPS4_LENGTH             equ 0001h
SMT1WINPPS_SMTWINPPS4_MASK               equ 0010h

