GopalSaraf/Practicals/PSDL/include/proc/pic16lf1614.inc
#define K110                             BANKMASK(PID1K1H), 2
#define K111                             BANKMASK(PID1K1H), 3
#define K112                             BANKMASK(PID1K1H), 4
#define K113                             BANKMASK(PID1K1H), 5
#define K114                             BANKMASK(PID1K1H), 6
#define K115                             BANKMASK(PID1K1H), 7
#define K12                              BANKMASK(PID1K1L), 2
#define K13                              BANKMASK(PID1K1L), 3
#define K14                              BANKMASK(PID1K1L), 4
#define K15                              BANKMASK(PID1K1L), 5
#define K16                              BANKMASK(PID1K1L), 6
#define K17                              BANKMASK(PID1K1L), 7
#define K18                              BANKMASK(PID1K1H), 0
#define K19                              BANKMASK(PID1K1H), 1
#define K20                              BANKMASK(PID1K2L), 0
#define K21                              BANKMASK(PID1K2L), 1
#define K210                             BANKMASK(PID1K2H), 2
#define K211                             BANKMASK(PID1K2H), 3
#define K212                             BANKMASK(PID1K2H), 4
#define K213                             BANKMASK(PID1K2H), 5
#define K214                             BANKMASK(PID1K2H), 6
#define K215                             BANKMASK(PID1K2H), 7
#define K22                              BANKMASK(PID1K2L), 2
#define K23                              BANKMASK(PID1K2L), 3
#define K24                              BANKMASK(PID1K2L), 4
#define K25                              BANKMASK(PID1K2L), 5
#define K26                              BANKMASK(PID1K2L), 6
#define K27                              BANKMASK(PID1K2L), 7
#define K28                              BANKMASK(PID1K2H), 0
#define K29                              BANKMASK(PID1K2H), 1
#define K30                              BANKMASK(PID1K3L), 0
#define K31                              BANKMASK(PID1K3L), 1
#define K310                             BANKMASK(PID1K3H), 2
#define K311                             BANKMASK(PID1K3H), 3
#define K312                             BANKMASK(PID1K3H), 4
#define K313                             BANKMASK(PID1K3H), 5
#define K314                             BANKMASK(PID1K3H), 6
#define K315                             BANKMASK(PID1K3H), 7
#define K32                              BANKMASK(PID1K3L), 2
#define K33                              BANKMASK(PID1K3L), 3
#define K34                              BANKMASK(PID1K3L), 4
#define K35                              BANKMASK(PID1K3L), 5
#define K36                              BANKMASK(PID1K3L), 6
#define K37                              BANKMASK(PID1K3L), 7
#define K38                              BANKMASK(PID1K3H), 0
#define K39                              BANKMASK(PID1K3H), 1
#define LADR10                           BANKMASK(SCANLADRH), 2
#define LADR11                           BANKMASK(SCANLADRH), 3
#define LADR12                           BANKMASK(SCANLADRH), 4
#define LADR13                           BANKMASK(SCANLADRH), 5
#define LADR14                           BANKMASK(SCANLADRH), 6
#define LADR15                           BANKMASK(SCANLADRH), 7
#define LADR2                            BANKMASK(SCANLADRL), 2
#define LADR3                            BANKMASK(SCANLADRL), 3
#define LADR4                            BANKMASK(SCANLADRL), 4
#define LADR5                            BANKMASK(SCANLADRL), 5
#define LADR6                            BANKMASK(SCANLADRL), 6
#define LADR7                            BANKMASK(SCANLADRL), 7
#define LADR8                            BANKMASK(SCANLADRH), 0
#define LADR9                            BANKMASK(SCANLADRH), 1
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA3                            BANKMASK(LATA), 3
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LATC0                            BANKMASK(LATC), 0
#define LATC1                            BANKMASK(LATC), 1
#define LATC2                            BANKMASK(LATC), 2
#define LATC3                            BANKMASK(LATC), 3
#define LATC4                            BANKMASK(LATC), 4
#define LATC5                            BANKMASK(LATC), 5
#define LC1D1S0                          BANKMASK(CLC1SEL0), 0
#define LC1D1S1                          BANKMASK(CLC1SEL0), 1
#define LC1D1S2                          BANKMASK(CLC1SEL0), 2
#define LC1D1S3                          BANKMASK(CLC1SEL0), 3
#define LC1D1S4                          BANKMASK(CLC1SEL0), 4
#define LC1D1S5                          BANKMASK(CLC1SEL0), 5
#define LC1D2S0                          BANKMASK(CLC1SEL1), 0
#define LC1D2S1                          BANKMASK(CLC1SEL1), 1
#define LC1D2S2                          BANKMASK(CLC1SEL1), 2
#define LC1D2S3                          BANKMASK(CLC1SEL1), 3
#define LC1D2S4                          BANKMASK(CLC1SEL1), 4
#define LC1D2S5                          BANKMASK(CLC1SEL1), 5
#define LC1D3S0                          BANKMASK(CLC1SEL2), 0
#define LC1D3S1                          BANKMASK(CLC1SEL2), 1
#define LC1D3S2                          BANKMASK(CLC1SEL2), 2
#define LC1D3S3                          BANKMASK(CLC1SEL2), 3
#define LC1D3S4                          BANKMASK(CLC1SEL2), 4
#define LC1D3S5                          BANKMASK(CLC1SEL2), 5
#define LC1D4S0                          BANKMASK(CLC1SEL3), 0
#define LC1D4S1                          BANKMASK(CLC1SEL3), 1
#define LC1D4S2                          BANKMASK(CLC1SEL3), 2
#define LC1D4S3                          BANKMASK(CLC1SEL3), 3
#define LC1D4S4                          BANKMASK(CLC1SEL3), 4
#define LC1D4S5                          BANKMASK(CLC1SEL3), 5
#define LC1EN                            BANKMASK(CLC1CON), 7
#define LC1G1D1N                         BANKMASK(CLC1GLS0), 0
#define LC1G1D1T                         BANKMASK(CLC1GLS0), 1
#define LC1G1D2N                         BANKMASK(CLC1GLS0), 2
#define LC1G1D2T                         BANKMASK(CLC1GLS0), 3
#define LC1G1D3N                         BANKMASK(CLC1GLS0), 4
#define LC1G1D3T                         BANKMASK(CLC1GLS0), 5
#define LC1G1D4N                         BANKMASK(CLC1GLS0), 6
#define LC1G1D4T                         BANKMASK(CLC1GLS0), 7
#define LC1G1POL                         BANKMASK(CLC1POL), 0
#define LC1G2D1N                         BANKMASK(CLC1GLS1), 0
#define LC1G2D1T                         BANKMASK(CLC1GLS1), 1
#define LC1G2D2N                         BANKMASK(CLC1GLS1), 2
#define LC1G2D2T                         BANKMASK(CLC1GLS1), 3
#define LC1G2D3N                         BANKMASK(CLC1GLS1), 4
#define LC1G2D3T                         BANKMASK(CLC1GLS1), 5
#define LC1G2D4N                         BANKMASK(CLC1GLS1), 6
#define LC1G2D4T                         BANKMASK(CLC1GLS1), 7
#define LC1G2POL                         BANKMASK(CLC1POL), 1
#define LC1G3D1N                         BANKMASK(CLC1GLS2), 0
#define LC1G3D1T                         BANKMASK(CLC1GLS2), 1
#define LC1G3D2N                         BANKMASK(CLC1GLS2), 2
#define LC1G3D2T                         BANKMASK(CLC1GLS2), 3
#define LC1G3D3N                         BANKMASK(CLC1GLS2), 4
#define LC1G3D3T                         BANKMASK(CLC1GLS2), 5
#define LC1G3D4N                         BANKMASK(CLC1GLS2), 6
#define LC1G3D4T                         BANKMASK(CLC1GLS2), 7
#define LC1G3POL                         BANKMASK(CLC1POL), 2
#define LC1G4D1N                         BANKMASK(CLC1GLS3), 0
#define LC1G4D1T                         BANKMASK(CLC1GLS3), 1
#define LC1G4D2N                         BANKMASK(CLC1GLS3), 2
#define LC1G4D2T                         BANKMASK(CLC1GLS3), 3
#define LC1G4D3N                         BANKMASK(CLC1GLS3), 4
#define LC1G4D3T                         BANKMASK(CLC1GLS3), 5
#define LC1G4D4N                         BANKMASK(CLC1GLS3), 6
#define LC1G4D4T                         BANKMASK(CLC1GLS3), 7
#define LC1G4POL                         BANKMASK(CLC1POL), 3
#define LC1INTN                          BANKMASK(CLC1CON), 3
#define LC1INTP                          BANKMASK(CLC1CON), 4
#define LC1MODE0                         BANKMASK(CLC1CON), 0
#define LC1MODE1                         BANKMASK(CLC1CON), 1
#define LC1MODE2                         BANKMASK(CLC1CON), 2
#define LC1OUT                           BANKMASK(CLC1CON), 5
#define LC1POL                           BANKMASK(CLC1POL), 7
#define LC2D1S0                          BANKMASK(CLC2SEL0), 0
#define LC2D1S1                          BANKMASK(CLC2SEL0), 1
#define LC2D1S2                          BANKMASK(CLC2SEL0), 2
#define LC2D1S3                          BANKMASK(CLC2SEL0), 3
#define LC2D1S4                          BANKMASK(CLC2SEL0), 4
#define LC2D1S5                          BANKMASK(CLC2SEL0), 5
#define LC2D2S0                          BANKMASK(CLC2SEL1), 0
#define LC2D2S1                          BANKMASK(CLC2SEL1), 1
#define LC2D2S2                          BANKMASK(CLC2SEL1), 2
#define LC2D2S3                          BANKMASK(CLC2SEL1), 3
#define LC2D2S4                          BANKMASK(CLC2SEL1), 4
#define LC2D2S5                          BANKMASK(CLC2SEL1), 5
#define LC2D3S0                          BANKMASK(CLC2SEL2), 0
#define LC2D3S1                          BANKMASK(CLC2SEL2), 1
#define LC2D3S2                          BANKMASK(CLC2SEL2), 2
#define LC2D3S3                          BANKMASK(CLC2SEL2), 3
#define LC2D3S4                          BANKMASK(CLC2SEL2), 4
#define LC2D3S5                          BANKMASK(CLC2SEL2), 5
#define LC2D4S0                          BANKMASK(CLC2SEL3), 0
#define LC2D4S1                          BANKMASK(CLC2SEL3), 1
#define LC2D4S2                          BANKMASK(CLC2SEL3), 2
#define LC2D4S3                          BANKMASK(CLC2SEL3), 3
#define LC2D4S4                          BANKMASK(CLC2SEL3), 4
#define LC2D4S5                          BANKMASK(CLC2SEL3), 5
#define LC2EN                            BANKMASK(CLC2CON), 7
#define LC2G1D1N                         BANKMASK(CLC2GLS0), 0
#define LC2G1D1T                         BANKMASK(CLC2GLS0), 1
#define LC2G1D2N                         BANKMASK(CLC2GLS0), 2
#define LC2G1D2T                         BANKMASK(CLC2GLS0), 3
#define LC2G1D3N                         BANKMASK(CLC2GLS0), 4
#define LC2G1D3T                         BANKMASK(CLC2GLS0), 5
#define LC2G1D4N                         BANKMASK(CLC2GLS0), 6
#define LC2G1D4T                         BANKMASK(CLC2GLS0), 7
#define LC2G1POL                         BANKMASK(CLC2POL), 0
#define LC2G2D1N                         BANKMASK(CLC2GLS1), 0
#define LC2G2D1T                         BANKMASK(CLC2GLS1), 1
#define LC2G2D2N                         BANKMASK(CLC2GLS1), 2
#define LC2G2D2T                         BANKMASK(CLC2GLS1), 3
#define LC2G2D3N                         BANKMASK(CLC2GLS1), 4
#define LC2G2D3T                         BANKMASK(CLC2GLS1), 5
#define LC2G2D4N                         BANKMASK(CLC2GLS1), 6
#define LC2G2D4T                         BANKMASK(CLC2GLS1), 7
#define LC2G2POL                         BANKMASK(CLC2POL), 1
#define LC2G3D1N                         BANKMASK(CLC2GLS2), 0
#define LC2G3D1T                         BANKMASK(CLC2GLS2), 1
#define LC2G3D2N                         BANKMASK(CLC2GLS2), 2
#define LC2G3D2T                         BANKMASK(CLC2GLS2), 3
#define LC2G3D3N                         BANKMASK(CLC2GLS2), 4
#define LC2G3D3T                         BANKMASK(CLC2GLS2), 5
#define LC2G3D4N                         BANKMASK(CLC2GLS2), 6
#define LC2G3D4T                         BANKMASK(CLC2GLS2), 7
#define LC2G3POL                         BANKMASK(CLC2POL), 2
#define LC2G4D1N                         BANKMASK(CLC2GLS3), 0
#define LC2G4D1T                         BANKMASK(CLC2GLS3), 1
#define LC2G4D2N                         BANKMASK(CLC2GLS3), 2
#define LC2G4D2T                         BANKMASK(CLC2GLS3), 3
#define LC2G4D3N                         BANKMASK(CLC2GLS3), 4
#define LC2G4D3T                         BANKMASK(CLC2GLS3), 5
#define LC2G4D4N                         BANKMASK(CLC2GLS3), 6
#define LC2G4D4T                         BANKMASK(CLC2GLS3), 7
#define LC2G4POL                         BANKMASK(CLC2POL), 3
#define LC2INTN                          BANKMASK(CLC2CON), 3
#define LC2INTP                          BANKMASK(CLC2CON), 4
#define LC2MODE0                         BANKMASK(CLC2CON), 0
#define LC2MODE1                         BANKMASK(CLC2CON), 1
#define LC2MODE2                         BANKMASK(CLC2CON), 2
#define LC2OUT                           BANKMASK(CLC2CON), 5
#define LC2POL                           BANKMASK(CLC2POL), 7
#define LD                               BANKMASK(CWG1CON0), 6
#define LDAR0                            BANKMASK(SCANLADRL), 0
#define LDAR1                            BANKMASK(SCANLADRL), 1
#define LFIOFR                           BANKMASK(OSCSTAT), 1
#define LSAC0                            BANKMASK(CWG1AS0), 2
#define LSAC1                            BANKMASK(CWG1AS0), 3
#define LSBD0                            BANKMASK(CWG1AS0), 4
#define LSBD1                            BANKMASK(CWG1AS0), 5
#define LWLO                             BANKMASK(PMCON1), 5
#define MC1OUT                           BANKMASK(CMOUT), 0
#define MC2OUT                           BANKMASK(CMOUT), 1
#define MFIOFR                           BANKMASK(OSCSTAT), 2
#define MISS0                            BANKMASK(AT1MISSL), 0
#define MISS1                            BANKMASK(AT1MISSL), 1
#define MISS10                           BANKMASK(AT1MISSH), 2
#define MISS11                           BANKMASK(AT1MISSH), 3
#define MISS12                           BANKMASK(AT1MISSH), 4
#define MISS13                           BANKMASK(AT1MISSH), 5
#define MISS14                           BANKMASK(AT1MISSH), 6
#define MISS15                           BANKMASK(AT1MISSH), 7
#define MISS2                            BANKMASK(AT1MISSL), 2
#define MISS3                            BANKMASK(AT1MISSL), 3
#define MISS4                            BANKMASK(AT1MISSL), 4
#define MISS5                            BANKMASK(AT1MISSL), 5
#define MISS6                            BANKMASK(AT1MISSL), 6
#define MISS7                            BANKMASK(AT1MISSL), 7
#define MISS8                            BANKMASK(AT1MISSH), 0
#define MISS9                            BANKMASK(AT1MISSH), 1
#define MLC1OUT                          BANKMASK(CLCDATA), 0
#define MLC2OUT                          BANKMASK(CLCDATA), 1
#define MODE                             BANKMASK(AT1CON0), 0
#define MPP                              BANKMASK(AT1CON1), 2
#define MSK0                             BANKMASK(SSP1MSK), 0
#define MSK1                             BANKMASK(SSP1MSK), 1
#define MSK2                             BANKMASK(SSP1MSK), 2
#define MSK3                             BANKMASK(SSP1MSK), 3
#define MSK4                             BANKMASK(SSP1MSK), 4
#define MSK5                             BANKMASK(SSP1MSK), 5
#define MSK6                             BANKMASK(SSP1MSK), 6
#define MSK7                             BANKMASK(SSP1MSK), 7
#define ODA0                             BANKMASK(ODCONA), 0
#define ODA1                             BANKMASK(ODCONA), 1
#define ODA2                             BANKMASK(ODCONA), 2
#define ODA4                             BANKMASK(ODCONA), 4
#define ODA5                             BANKMASK(ODCONA), 5
#define ODC0                             BANKMASK(ODCONC), 0
#define ODC1                             BANKMASK(ODCONC), 1
#define ODC2                             BANKMASK(ODCONC), 2
#define ODC3                             BANKMASK(ODCONC), 3
#define ODC4                             BANKMASK(ODCONC), 4
#define ODC5                             BANKMASK(ODCONC), 5
#define OERR                             BANKMASK(RC1STA), 1
#define OUT0                             BANKMASK(PID1OUTLL), 0
#define OUT1                             BANKMASK(PID1OUTLL), 1
#define OUT10                            BANKMASK(PID1OUTLH), 2
#define OUT11                            BANKMASK(PID1OUTLH), 3
#define OUT12                            BANKMASK(PID1OUTLH), 4
#define OUT13                            BANKMASK(PID1OUTLH), 5
#define OUT14                            BANKMASK(PID1OUTLH), 6
#define OUT15                            BANKMASK(PID1OUTLH), 7
#define OUT16                            BANKMASK(PID1OUTHL), 0
#define OUT17                            BANKMASK(PID1OUTHL), 1
#define OUT18                            BANKMASK(PID1OUTHL), 2
#define OUT19                            BANKMASK(PID1OUTHL), 3
#define OUT2                             BANKMASK(PID1OUTLL), 2
#define OUT20                            BANKMASK(PID1OUTHL), 4
#define OUT21                            BANKMASK(PID1OUTHL), 5
#define OUT22                            BANKMASK(PID1OUTHL), 6
#define OUT23                            BANKMASK(PID1OUTHL), 7
#define OUT24                            BANKMASK(PID1OUTHH), 0
#define OUT25                            BANKMASK(PID1OUTHH), 1
#define OUT26                            BANKMASK(PID1OUTHH), 2
#define OUT27                            BANKMASK(PID1OUTHH), 3
#define OUT28                            BANKMASK(PID1OUTHH), 4
#define OUT29                            BANKMASK(PID1OUTHH), 5
#define OUT3                             BANKMASK(PID1OUTLL), 3
#define OUT30                            BANKMASK(PID1OUTHH), 6
#define OUT31                            BANKMASK(PID1OUTHH), 7
#define OUT32                            BANKMASK(PID1OUTU), 0
#define OUT33                            BANKMASK(PID1OUTU), 1
#define OUT34                            BANKMASK(PID1OUTU), 2
#define OUT35                            BANKMASK(PID1OUTU), 3
#define OUT4                             BANKMASK(PID1OUTLL), 4
#define OUT5                             BANKMASK(PID1OUTLL), 5
#define OUT6                             BANKMASK(PID1OUTLL), 6
#define OUT7                             BANKMASK(PID1OUTLL), 7
#define OUT8                             BANKMASK(PID1OUTLH), 0
#define OUT9                             BANKMASK(PID1OUTLH), 1
#define OVRA                             BANKMASK(CWG1OCON0), 4
#define OVRB                             BANKMASK(CWG1OCON0), 5
#define OVRC                             BANKMASK(CWG1OCON0), 6
#define OVRD                             BANKMASK(CWG1OCON0), 7
#define P3TSEL0                          BANKMASK(CCPTMRS), 4
#define P3TSEL1                          BANKMASK(CCPTMRS), 5
#define P4TSEL0                          BANKMASK(CCPTMRS), 6
#define P4TSEL1                          BANKMASK(CCPTMRS), 7
#define PCIE                             BANKMASK(SSP1CON3), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PEN                              BANKMASK(SSP1CON2), 2
#define PER0                             BANKMASK(AT1PERL), 0
#define PER1                             BANKMASK(AT1PERL), 1
#define PER10                            BANKMASK(AT1PERH), 2
#define PER11                            BANKMASK(AT1PERH), 3
#define PER12                            BANKMASK(AT1PERH), 4
#define PER13                            BANKMASK(AT1PERH), 5
#define PER14                            BANKMASK(AT1PERH), 6
#define PER15                            BANKMASK(AT1PERH), 7
#define PER2                             BANKMASK(AT1PERL), 2
#define PER3                             BANKMASK(AT1PERL), 3
#define PER4                             BANKMASK(AT1PERL), 4
#define PER5                             BANKMASK(AT1PERL), 5
#define PER6                             BANKMASK(AT1PERL), 6
#define PER7                             BANKMASK(AT1PERL), 7
#define PER8                             BANKMASK(AT1PERH), 0
#define PER9                             BANKMASK(AT1PERH), 1
#define PERH0                            BANKMASK(AT1PERH), 0
#define PERH1                            BANKMASK(AT1PERH), 1
#define PERH2                            BANKMASK(AT1PERH), 2
#define PERH3                            BANKMASK(AT1PERH), 3
#define PERH4                            BANKMASK(AT1PERH), 4
#define PERH5                            BANKMASK(AT1PERH), 5
#define PERH6                            BANKMASK(AT1PERH), 6
#define PERH7                            BANKMASK(AT1PERH), 7
#define PERL0                            BANKMASK(AT1PERL), 0
#define PERL1                            BANKMASK(AT1PERL), 1
#define PERL2                            BANKMASK(AT1PERL), 2
#define PERL3                            BANKMASK(AT1PERL), 3
#define PERL4                            BANKMASK(AT1PERL), 4
#define PERL5                            BANKMASK(AT1PERL), 5
#define PERL6                            BANKMASK(AT1PERL), 6
#define PERL7                            BANKMASK(AT1PERL), 7
#define PHP                              BANKMASK(AT1CON1), 6
#define PHS0                             BANKMASK(AT1PHSL), 0
#define PHS1                             BANKMASK(AT1PHSL), 1
#define PHS2                             BANKMASK(AT1PHSL), 2
#define PHS3                             BANKMASK(AT1PHSL), 3
#define PHS4                             BANKMASK(AT1PHSL), 4
#define PHS5                             BANKMASK(AT1PHSL), 5
#define PHS6                             BANKMASK(AT1PHSL), 6
#define PHS7                             BANKMASK(AT1PHSL), 7
#define PHS8                             BANKMASK(AT1PHSH), 0
#define PHS9                             BANKMASK(AT1PHSH), 1
#define PHSL8                            BANKMASK(AT1PHSH), 0
#define PHSL9                            BANKMASK(AT1PHSH), 1
#define PID1ACC0                         BANKMASK(PID1ACCLL), 0
#define PID1ACC1                         BANKMASK(PID1ACCLL), 1
#define PID1ACC10                        BANKMASK(PID1ACCLH), 2
#define PID1ACC11                        BANKMASK(PID1ACCLH), 3
#define PID1ACC12                        BANKMASK(PID1ACCLH), 4
#define PID1ACC13                        BANKMASK(PID1ACCLH), 5
#define PID1ACC14                        BANKMASK(PID1ACCLH), 6
#define PID1ACC15                        BANKMASK(PID1ACCLH), 7
#define PID1ACC16                        BANKMASK(PID1ACCHL), 0
#define PID1ACC17                        BANKMASK(PID1ACCHL), 1
#define PID1ACC18                        BANKMASK(PID1ACCHL), 2
#define PID1ACC19                        BANKMASK(PID1ACCHL), 3
#define PID1ACC2                         BANKMASK(PID1ACCLL), 2
#define PID1ACC20                        BANKMASK(PID1ACCHL), 4
#define PID1ACC21                        BANKMASK(PID1ACCHL), 5
#define PID1ACC22                        BANKMASK(PID1ACCHL), 6
#define PID1ACC23                        BANKMASK(PID1ACCHL), 7
#define PID1ACC24                        BANKMASK(PID1ACCHH), 0
#define PID1ACC25                        BANKMASK(PID1ACCHH), 1
#define PID1ACC26                        BANKMASK(PID1ACCHH), 2
#define PID1ACC27                        BANKMASK(PID1ACCHH), 3
#define PID1ACC28                        BANKMASK(PID1ACCHH), 4
#define PID1ACC29                        BANKMASK(PID1ACCHH), 5
#define PID1ACC3                         BANKMASK(PID1ACCLL), 3
#define PID1ACC30                        BANKMASK(PID1ACCHH), 6
#define PID1ACC31                        BANKMASK(PID1ACCHH), 7
#define PID1ACC32                        BANKMASK(PID1ACCU), 0
#define PID1ACC33                        BANKMASK(PID1ACCU), 1
#define PID1ACC34                        BANKMASK(PID1ACCU), 2
#define PID1ACC4                         BANKMASK(PID1ACCLL), 4
#define PID1ACC5                         BANKMASK(PID1ACCLL), 5
